//
//  Localizable.strings
//  Stats
//
//  Created by Serhiy Mytrovtsiy on 27/08/2020.
//  Using Swift 5.0.
//  Running on macOS 10.15.
//
//  Copyright © 2020 Serhiy Mytrovtsiy. All rights reserved.
//

// Modules
"CPU" = "ซีพียู"; // translategemma:4b
"Open CPU settings" = "เปิดการตั้งค่า CPU";
"GPU" = "หน่วยประมวลผลกราฟิก (GPU)"; // translategemma:4b
"Open GPU settings" = "เปิดการตั้งค่า GPU";
"RAM" = "RAM";
"Open RAM settings" = "เปิดการตั้งค่า RAM";
"Disk" = "ดิสก์";
"Open Disk settings" = "เปิดการตั้งค่าดิสก์";
"Sensors" = "เซ็นเซอร์";
"Open Sensors settings" = "เปิดการตั้งค่าเซ็นเซอร์";
"Network" = "เครือข่าย";
"Open Network settings" = "เปิดการตั้งค่าเครือข่าย";
"Battery" = "แบตเตอรี่";
"Open Battery settings" = "เปิดการตั้งค่าแบตเตอรี่";
"Bluetooth" = "บลูทูธ";
"Open Bluetooth settings" = "เปิดการตั้งค่าบลูทูธ";
"Clock" = "นาฬิกา"; // translategemma:4b
"Open Clock settings" = "เปิดการตั้งค่านาฬิกา"; // translategemma:4b

// Words
"Unknown" = "ไม่ทราบที่มา";
"Version" = "เวอร์ชัน";
"Processor" = "หน่วยประมวลผล";
"Memory" = "หน่วยความจำ";
"Graphics" = "กราฟิก";
"Close" = "ปิด";
"Download" = "ดาวน์โหลด";
"Install" = "ติดตั้ง";
"Cancel" = "ยกเลิก";
"Unavailable" = "ไม่สามารถใช้งานได้";
"Yes" = "ใช่";
"No" = "ไม่";
"Automatic" = "อัตโนมัติ";
"Manual" = "ด้วยตนเอง";
"None" = "ไม่มี";
"Dots" = "จุด";
"Arrows" = "ลูกศร";
"Characters" = "ตัวอักษร";
"Short" = "สั้น";
"Long" = "ยาว";
"Statistics" = "สถิติ";
"Max" = "สูงสุด";
"Min" = "ต่ำสุด";
"Reset" = "รีเซ็ต";
"Alignment" = "การจัดแนว";
"Left alignment" = "จัดแนวซ้าย";
"Center alignment" = "จัดแนวกึ่งกลาง";
"Right alignment" = "จัดแนวขวา";
"Dashboard" = "แดชบอร์ด";
"Enabled" = "เปิดใช้งาน";
"Disabled" = "ปิดใช้งาน";
"Silent" = "ไม่เสียง";
"Units" = "หน่วย";
"Fans" = "พัดลม";
"Scaling" = "ขนาด";
"Linear" = "เชิงเส้น";
"Square" = "สี่เหลี่ยม";
"Cube" = "ลูกบาศก์";
"Logarithmic" = "ลอการิทึม";
"Fixed scale" = "แก้ไขแล้ว"; // translategemma:4b
"Cores" = "หน่วยความจำ";
"Settings" = "การตั้งค่า";
"Name" = "ชื่อ"; // translategemma:4b
"Format" = "รูปแบบ"; // translategemma:4b
"Turn off" = "ปิด"; // translategemma:4b
"Normal" = "ปกติ"; // translategemma:4b
"Warning" = "คำเตือน"; // translategemma:4b
"Critical" = "สำคัญ"; // translategemma:4b
"Usage" = "การใช้งาน"; // translategemma:4b
"2 minutes" = "2 นาที"; // translategemma:4b
"3 minutes" = "3 นาที"; // translategemma:4b
"10 minutes" = "10 นาที"; // translategemma:4b
"Import" = "นำเข้า"; // translategemma:4b
"Export" = "ส่งออก"; // translategemma:4b
"Separator" = "ตัวแบ่ง"; // translategemma:4b
"Read" = "อ่าน"; // translategemma:4b
"Write" = "เขียน"; // translategemma:4b
"Frequency" = "ความถี่"; // translategemma:4b
"Save" = "บันทึก"; // translategemma:4b
"Run" = "รัน"; // translategemma:4b
"Stop" = "หยุด"; // translategemma:4b
"Uninstall" = "ถอนการติดตั้ง"; // translategemma:4b
"1 sec" = "1 วินาที"; // translategemma:4b
"2 sec" = "2 วินาที"; // translategemma:4b
"3 sec" = "3 วินาที"; // translategemma:4b
"5 sec" = "5 วินาที"; // translategemma:4b
"10 sec" = "10 วินาที"; // translategemma:4b
"15 sec" = "15 วินาที"; // translategemma:4b
"30 sec" = "30 วินาที"; // translategemma:4b
"60 sec" = "60 วินาที"; // translategemma:4b

// Setup
"Stats Setup" = "การตั้งค่าสถิติ";
"Previous" = "ก่อนหน้า";
"Previous page" = "หน้าก่อนหน้า";
"Next" = "ถัดไป";
"Next page" = "หน้าถัดไป";
"Finish" = "สิ้นสุด";
"Finish setup" = "สิ้นสุดการตั้งค่า";
"Welcome to Stats" = "ยินดีต้อนรับเข้าสู่ Stats";
"welcome_message" = "ขอบคุณที่ใช้ Stats ซอฟต์แวร์แบบโอเพ่นซอร์สและใช้งานฟรีเพื่อตรวจสอบระบบ Mac ของคุณ";
"Start the application automatically when starting your Mac" = "เริ่มต้นแอปพลิเคชันโดยอัตโนมัติเมื่อเปิดเครื่อง Mac ของคุณ";
"Do not start the application automatically when starting your Mac" = "ไม่ต้องเริ่มแอปพลิเคชันโดยอัตโนมัติเมื่อเปิดเครื่อง Mac ของคุณ";
"Do everything silently in the background (recommended)" = "ทำทุกอย่างเงียบ ๆ ในแบคกราว (แนะนำ)";
"Check for a new version on startup" = "ตรวจสอบเวอร์ชันใหม่เมื่อเริ่มต้น";
"Check for a new version every day (once a day)" = "ตรวจสอบเวอร์ชันใหม่ทุกวัน (วันละครั้ง)";
"Check for a new version every week (once a week)" = "ตรวจสอบเวอร์ชันใหม่ทุกสัปดาห์ (สัปดาห์ละครั้ง)";
"Check for a new version every month (once a month)" = "ตรวจสอบเวอร์ชันใหม่ทุกเดือน (เดือนละครั้ง)";
"Never check for updates (not recommended)" = "ไม่เช็คการอัปเดต (ไม่แนะนำ)";
"Anonymous telemetry for better development decisions" = "ข้อมูล telemetry ที่ไม่ระบุชื่อ เพื่อการตัดสินใจในการพัฒนาที่ดีขึ้น"; // translategemma:4b
"Share anonymous telemetry data" = "แบ่งปันข้อมูล telemetry ที่ไม่ระบุตัวตน"; // translategemma:4b
"Do not share anonymous telemetry data" = "ห้ามเปิดเผยข้อมูล telemetry ที่ไม่ระบุตัวตน"; // translategemma:4b
"The configuration is completed" = "การกำหนดค่าเสร็จสมบูรณ์";
"finish_setup_message" = "ทุกอย่างถูกตั้งค่า! \n Stats เป็นเครื่องมือโอเพ่นซอร์สที่ฟรีและจะเป็นแบบนี้ตลอดไป \n ถ้าคุณชอบ คุณสามารถสนับสนุนโปรเจคนี้ เราพร้อมรับและขอบคุณเสมอ!";

// Alerts
"New version available" = "มีเวอร์ชันใหม่ให้ใช้งาน";
"Click to install the new version of Stats" = "คลิกเพื่อติดตั้งเวอร์ชันใหม่ของ Stats";
"Successfully updated" = "อัพเดทสำเร็จ";
"Stats was updated to v" = "Stats อัพเดทเป็น v%0";
"Reset settings text" = "การตั้งค่าของแอพพลิเคชันทั้งหมดจะถูกรีเซ็ตและแอพพลิเคชันจะเริ่มต้นใหม่ คุณแน่ใจหรือไม่ว่าต้องการดำเนินการนี้?";
"Support text" = "ขอขอบคุณที่ใช้ Stats!\n\n การบำรุงรักษาและปรับปรุงโครงการโอเพนซอร์สนี้ต้องใช้เวลาและทรัพยากร การสนับสนุนของคุณช่วยให้เราสามารถให้บริการแอปพลิเคชันฟรีและเชื่อถือได้สำหรับทุกคนต่อไปได้\n\n หากคุณพบว่า Stats มีประโยชน์ โปรดพิจารณาให้ความช่วยเหลือ ทุก ๆ ความช่วยเหลือเล็ก ๆ น้อย ๆ ล้วนมีประโยชน์!";

// Settings
"Open Activity Monitor" = "เปิด Activity Monitor";
"Report a bug" = "รายงานข้อผิดพลาด";
"Support the application" = "สนับสนุนแอปพลิเคชัน";
"Close application" = "ปิดแอปพลิเคชัน";
"Open application settings" = "เปิดการตั้งค่าแอปพลิเคชัน";
"Open dashboard" = "เปิดแดชบอร์ด";
"No notifications available in this module" = "ไม่มีการแจ้งเตือนใด ๆ ในโมดูลนี้"; // translategemma:4b
"Open Calendar" = "เปิดปฏิทิน"; // translategemma:4b
"Toggle the module" = "เปิด/ปิดโมดูล"; // translategemma:4b

// Application settings
"Update application" = "อัพเดทแอปพลิเคชัน";
"Check for updates" = "ตรวจสอบการอัพเดท";
"At start" = "เริ่มต้น";
"Once per day" = "ครั้งละ 1 วัน";
"Once per week" = "ครั้งละ 1 สัปดาห์";
"Once per month" = "ครั้งละ 1 เดือน";
"Never" = "ไม่เคย";
"Check for update" = "ตรวจสอบการอัพเดท";
"Show icon in dock" = "แสดงไอคอนใน dock";
"Start at login" = "เริ่มต้นเมื่อเข้าสู่ระบบ";
"Build number" = "หมายเลข Build";
"Import settings" = "นำเข้าการตั้งค่า"; // translategemma:4b
"Export settings" = "การตั้งค่าการส่งออก"; // translategemma:4b
"Reset settings" = "รีเซ็ตการตั้งค่า";
"Pause the Stats" = "หยุด Stats";
"Resume the Stats" = "เริ่มต้น Stats";
"Combined modules" = "โมดูลผสม";
"Combined details" = "รายละเอียดที่รวบรวม"; // translategemma:4b
"Spacing" = "ระยะห่าง"; // translategemma:4b
"Share anonymous telemetry" = "แบ่งปันข้อมูล telemetry แบบไม่ระบุตัวตน"; // translategemma:4b
"Choose file" = "เลือกไฟล์"; // translategemma:4b
"Stress tests" = "การทดสอบความเครียด"; // translategemma:4b

// Dashboard
"Serial number" = "หมายเลขซีเรียล";
"Model identifier" = "รหัสรุ่น"; // translategemma:4b
"Production year" = "ปีที่ผลิต"; // translategemma:4b
"Uptime" = "ระยะเวลาที่เครื่องทำงาน";
"Number of cores" = "%0 คอร์"; // translategemma:4b
"Number of threads" = "%0 thread";
"Number of e-cores" = "%0 cores ประสิทธิภาพ";
"Number of p-cores" = "%0 cores ประสิทธิผล";
"Disks" = "ฮาร์ดดิสก์"; // translategemma:4b
"Display" = "แสดงผล"; // translategemma:4b

// Update
"The latest version of Stats installed" = "เวอร์ชันล่าสุดของ Stats ได้รับการติดตั้งแล้ว";
"Downloading..." = "กำลังดาวน์โหลด...";
"Current version: " = "เวอร์ชันปัจจุบัน: ";
"Latest version: " = "เวอร์ชันล่าสุด: ";

// Widgets
"Color" = "สี";
"Label" = "ป้ายชื่อ";
"Box" = "กล่อง";
"Frame" = "เฟรม";
"Value" = "ค่า";
"Colorize" = "สีสัน";
"Colorize value" = "สีสันค่า";
"Additional information" = "ข้อมูลเพิ่มเติม";
"Reverse values order" = "ย้อนกลับลำดับค่า";
"Base" = "ฐาน";
"Display mode" = "แสดงโหมด";
"One row" = "หนึ่งแถว";
"Two rows" = "สองแถว";
"Mini widget" = "วิดเจ็ตขนาดเล็ก";
"Line chart widget" = "แผนภูมิเส้น";
"Bar chart widget" = "แผนภูมิแท่ง";
"Pie chart widget" = "แผนภูมิวงกลม";
"Network chart widget" = "แผนภูมิเครือข่าย";
"Speed widget" = "ความเร็ว";
"Battery widget" = "แบตเตอรี่";
"Stack widget" = "คอลัม"; // translategemma:4b
"Memory widget" = "หน่วยความจำ";
"Static width" = "ความกว้างคงที่";
"Tachometer widget" = "วัดความเร็ว";
"State widget" = "เครื่องวัดสถานะ";
"Text widget" = "ส่วนประกอบสำหรับแสดงข้อความ"; // translategemma:4b
"Battery details widget" = "หน้าปัดข้อมูลแบตเตอรี่"; // translategemma:4b
"Show symbols" = "แสดงสัญลักษณ์";
"Label widget" = "ป้ายชื่อ";
"Number of reads in the chart" = "จำนวนการอ่านในแผนภูมิ";
"Color of download" = "สีของการดาวน์โหลด";
"Color of upload" = "สีของการอัพโหลด";
"Monospaced font" = "แบบอักษรโมโนสเปซ";
"Reverse order" = "ลำดับย้อนกลับ"; // translategemma:4b
"Chart history" = "ประวัติการสร้างกราฟ"; // translategemma:4b
"Default color" = "ค่าเริ่มต้น"; // translategemma:4b
"Transparent when no activity" = "โปร่งใสเมื่อไม่มีการใช้งาน"; // translategemma:4b
"Constant color" = "คงที่"; // translategemma:4b

// Module Kit
"Open module settings" = "เปิดการตั้งค่าโมดูล";
"Select widget" = "เลือก widget %0";
"Open widget settings" = "เปิดการตั้งค่าวิดเจ็ต";
"Update interval" = "ช่วงเวลาปรับปรุง";
"Usage history" = "ประวัติการใช้งาน";
"Details" = "รายละเอียด";
"Top processes" = "กระบวนการบนสุด";
"Pictogram" = "รูปภาพสัญลักษณ์";
"Module" = "โมดูล";
"Widgets" = "วิดเจ็ต";
"Popup" = "ป๊อปอัพ";
"Notifications" = "การแจ้งเตือน";
"Merge widgets" = "รวมวิดเจ็ต";
"No available widgets to configure" = "ไม่มีวิดเจ็ตที่สามารถกำหนดค่าได้";
"No options to configure for the popup in this module" = "ไม่มีตัวเลือกที่สามารถกำหนดค่าสำหรับป๊อปอัปในโมดูลนี้";
"Process" = "กระบวนการ"; // translategemma:4b
"Kill process" = "หยุดกระบวนการ"; // translategemma:4b
"Keyboard shortcut" = "ปุ่มลัดคีย์"; // translategemma:4b
"Listening..." = "กำลังฟัง..."; // translategemma:4b

// Modules
"Number of top processes" = "จำนวนของกระบวนการสูงสุด";
"Update interval for top processes" = "ช่วงเวลาปรับปรุงสำหรับกระบวนการสูงสุด";
"Notification level" = "ระดับแจ้งเตือน";
"Chart color" = "สีแผนภูมิ";
"Main chart scaling" = "การปรับขนาดกราฟหลัก"; // translategemma:4b
"Scale value" = "ค่าสเกล"; // translategemma:4b
"Text widget value" = "ค่าสำหรับส่วนประกอบ Text"; // translategemma:4b

// CPU
"CPU usage" = "การใช้งาน CPU";
"CPU temperature" = "อุณหภูมิ CPU";
"CPU frequency" = "ความถี่ CPU";
"System" = "ระบบ";
"User" = "ผู้ใช้";
"Idle" = "ว่างเปล่า";
"Show usage per core" = "แสดงการใช้งานต่อหนึ่ง core";
"Show hyper-threading cores" = "แสดง hyper-threading cores";
"Split the value (System/User)" = "แบ่งค่า (ระบบ/ผู้ใช้)";
"Scheduler limit" = "ขีดจำกัดของ Scheduler";
"Speed limit" = "ขีดจำกัดความเร็ว";
"Average load" = "โหลดเฉลี่ย";
"1 minute" = "1 นาที";
"5 minutes" = "5 นาที";
"15 minutes" = "15 นาที";
"CPU usage threshold" = "เกณฑ์การใช้งาน CPU";
"CPU usage is" = "การใช้งาน CPU คือ %0";
"Efficiency cores" = "cores ประสิทธิผล";
"Performance cores" = "cores ประสิทธิภาพ";
"System color" = "สีของระบบ";
"User color" = "สีของผู้ใช้";
"Idle color" = "สีของว่างเปล่า";
"Cluster grouping" = "การจัดกลุ่ม Cluster";
"Efficiency cores color" = "จำนวนคอร์ประสิทธิภาพ สี"; // translategemma:4b
"Performance cores color" = "สีของคอร์ประสิทธิภาพ"; // translategemma:4b
"Total load" = "ปริมาณการใช้งานทั้งหมด"; // translategemma:4b
"System load" = "ภาระของระบบ"; // translategemma:4b
"User load" = "ปริมาณการใช้งานของผู้ใช้"; // translategemma:4b
"Efficiency cores load" = "การโหลดคอร์ประสิทธิภาพ"; // translategemma:4b
"Performance cores load" = "การโหลดคอร์ประสิทธิภาพ"; // translategemma:4b
"All cores" = "ทุกคอร์"; // translategemma:4b

// GPU
"GPU to show" = "แสดง GPU";
"Show GPU type" = "แสดงประเภท GPU";
"GPU enabled" = "GPU เปิดการใช้งาน";
"GPU disabled" = "GPU ปิดการใช้งาน";
"GPU temperature" = "อุณหภูมิ GPU";
"GPU utilization" = "ปริมาณการใช้งาน GPU";
"Vendor" = "ผู้ผลิต";
"Model" = "โมเดล";
"Status" = "สถานะ";
"Active" = "ทำงาน";
"Non active" = "ไม่ได้ทำงาน";
"Fan speed" = "ความเร็วพัดลม";
"Core clock" = "ความถี่หลัก"; // translategemma:4b
"Memory clock" = "ความถี่ของหน่วยความจำ"; // translategemma:4b
"Utilization" = "ปริมาณการใช้งาน";
"Render utilization" = "ปริมาณการใช้งาน Render";
"Tiler utilization" = "ปริมาณการใช้งาน Tiler";
"GPU usage threshold" = "เกณฑ์การใช้งาน GPU";
"GPU usage is" = "ปริมาณการใช้งาน GPU คือ %0";

// RAM
"Memory usage" = "การใช้หน่วยความจำ";
"Memory pressure" = "ความกดดันหน่วยของความจำ";
"Total" = "รวม";
"Used" = "ใช้งาน";
"App" = "แอพ";
"Wired" = "แบบมีสาย"; // translategemma:4b
"Compressed" = "บีบอัด";
"Free" = "ว่าง";
"Swap" = "Swap";
"Split the value (App/Wired/Compressed)" = "แบ่งค่า (แอพ / Wired / บีบอัด)";
"RAM utilization threshold" = "ขีดจำกัดการใช้หน่วยความจำ";
"RAM utilization is" = "การใช้หน่วยความจำคือ %0";
"App color" = "สีของแอพ";
"Wired color" = "สี Wired";
"Compressed color" = "สีที่บีบอัด";
"Free color" = "สีที่ว่าง";
"Free memory (less than)" = "หน่วยความจำเหลือ (น้อยกว่า)"; // translategemma:4b
"Swap size" = "ขนาดของการแลกเปลี่ยน"; // translategemma:4b
"Free RAM is" = "RAM ที่เหลือคือ %0"; // translategemma:4b

// Disk
"Show removable disks" = "แสดงดิสก์ถอดได้";
"Used disk memory" = "ใช้ %0 จาก %1";
"Free disk memory" = "ว่าง %0 จาก %1";
"Disk to show" = "ดิสก์แสดง";
"Open disk" = "เปิดดิสก์";
"Switch view" = "สลับมุมมอง";
"Disk utilization threshold" = "เกณฑ์การใช้งานดิสก์";
"Disk utilization is" = "ปริมาณการใช้งานดิสก์คือ %0";
"Read color" = "อ่านสี"; // translategemma:4b
"Write color" = "ระบุสี"; // translategemma:4b
"Disk usage" = "การใช้พื้นที่ดิสก์"; // translategemma:4b
"Total read" = "จำนวนที่อ่านทั้งหมด"; // translategemma:4b
"Total written" = "ยอดที่เขียน"; // translategemma:4b
"Write speed" = "เขียน"; // translategemma:4b
"Read speed" = "อ่าน"; // translategemma:4b
"Drives" = "อุปกรณ์"; // translategemma:4b
"SMART data" = "ข้อมูล SMART"; // translategemma:4b

// Sensors
"Temperature unit" = "หน่วยอุณหภูมิ";
"Celsius" = "เซลเซียส";
"Fahrenheit" = "ฟาเรนไฮต์";
"Save the fan speed" = "บันทึกความเร็วพัดลม";
"Fan" = "พัดลม";
"HID sensors" = "เซ็นเซอร์ HID";
"Synchronize fan's control" = "ปรับการควบคุมพัดลม";
"Current" = "ปัจจุบัน";
"Energy" = "พลังงาน";
"Show unknown sensors" = "แสดงเซ็นเซอร์ที่ไม่รู้จัก";
"Install fan helper" = "ติดตั้งตัวช่วยพัดลม";
"Uninstall fan helper" = "ถอนการติดตั้งตัวช่วยพัดลม";
"Fan value" = "ค่าพัดลม";
"Turn off fan" = "ปิดพัดลม"; // translategemma:4b
"You are going to turn off the fan. This is not recommended action that can damage your mac, are you sure you want to do that?" = "คุณกำลังจะปิดพัดลม นี่เป็นการกระทำที่ไม่แนะนำ ซึ่งอาจทำให้เครื่อง Mac ของคุณเสียหาย คุณแน่ใจหรือไม่ว่าคุณต้องการทำเช่นนั้น"; // translategemma:4b
"Sensor threshold" = "ขีดจำกัดของเซ็นเซอร์"; // translategemma:4b
"Left fan" = "ซ้าย"; // translategemma:4b
"Right fan" = "ถูกต้อง"; // translategemma:4b
"Fastest fan" = "เร็วที่สุด"; // translategemma:4b
"Sensor to show" = "เซ็นเซอร์เพื่อแสดงผล"; // translategemma:4b

// Network
"Uploading" = "กำลังอัปโหลด";
"Downloading" = "กำลังดาวน์โหลด";
"Public IP" = "IP สาธารณะ";
"Local IP" = "IP ในเครือข่าย";
"Interface" = "อินเตอร์เฟส";
"Physical address" = "ที่อยู่ทางกายภาพ";
"Refresh" = "รีเฟรช";
"Click to copy public IP address" = "คลิกเพื่อคัดลอก IP สาธารณะ";
"Click to copy local IP address" = "คลิกเพื่อคัดลอก IP ในเครือข่าย";
"Click to copy wifi name" = "คลิกเพื่อคัดลอกชื่อ WIFI";
"Click to copy mac address" = "คลิกเพื่อคัดลอกที่อยู่ MAC";
"No connection" = "ไม่มีการเชื่อมต่อ";
"Network interface" = "อินเตอร์เฟสเครือข่าย";
"Total download" = "ดาวน์โหลดทั้งหมด";
"Total upload" = "อัปโหลดทั้งหมด";
"Reader type" = "ประเภทของอ่านข้อมูล";
"Interface based" = "ยึดตามอินเตอร์เฟส";
"Processes based" = "ยึดตามกระบวนการ";
"Reset data usage" = "รีเซ็ตการใช้งานข้อมูล";
"VPN mode" = "โหมด VPN";
"Standard" = "มาตรฐาน";
"Security" = "ความปลอดภัย";
"Channel" = "ช่อง";
"Common scale" = "มาตรฐานทั่วไป";
"Autodetection" = "ตรวจหาอัตโนมัติ";
"Widget activation threshold" = "ขีดจำกัดของการเปิดใช้งานวิดเจ็ต";
"Internet connection" = "การเชื่อมต่ออินเทอร์เน็ต";
"Active state color" = "สีของสถานะที่ใช้งาน";
"Nonactive state color" = "สีของสถานะที่ไม่ใช้งาน";
"Connectivity host (ICMP)" = "โฮสต์ที่เชื่อมต่อ (ICMP)";
"Leave empty to disable the check" = "เว้นว่างไว้เพื่อปิดการตรวจสอบ";
"Connectivity history" = "ประวัติการเชื่อมต่อ"; // translategemma:4b
"Auto-refresh public IP address" = "อัปเดตที่อยู่ IP สาธารณะโดยอัตโนมัติ"; // translategemma:4b
"Every hour" = "ทุกชั่วโมง"; // translategemma:4b
"Every 12 hours" = "ทุก 12 ชั่วโมง"; // translategemma:4b
"Every 24 hours" = "ทุก 24 ชั่วโมง"; // translategemma:4b
"Network activity" = "กิจกรรมบนเครือข่าย"; // translategemma:4b
"Last reset" = "การรีเซ็ตครั้งล่าสุดเมื่อ `%0` ที่แล้ว"; // translategemma:4b
"Latency" = "ความหน่วง"; // translategemma:4b
"Upload speed" = "อัปโหลด"; // translategemma:4b
"Download speed" = "ดาวน์โหลด"; // translategemma:4b
"Address" = "ที่อยู่"; // translategemma:4b
"WiFi network" = "เครือข่าย Wi-Fi"; // translategemma:4b
"Local IP changed" = "ที่อยู่ IP ในเครื่องเปลี่ยนไปแล้ว"; // translategemma:4b
"Public IP changed" = "ที่อยู่ IP สาธารณะมีการเปลี่ยนแปลง"; // translategemma:4b
"Previous IP" = "IP ก่อนหน้า: %0"; // translategemma:4b
"New IP" = "IP ใหม่: %0"; // translategemma:4b
"Internet connection lost" = "การเชื่อมต่ออินเทอร์เน็ตขาด"; // translategemma:4b
"Internet connection established" = "การเชื่อมต่ออินเทอร์เน็ตสำเร็จ"; // translategemma:4b

// Battery
"Level" = "ระดับ";
"Source" = "แหล่งที่มา";
"AC Power" = "พลังงาน AC";
"Battery Power" = "พลังงานแบตเตอรี่";
"Time" = "เวลา";
"Health" = "สุขภาพ";
"Amperage" = "กระแสไฟ";
"Voltage" = "แรงดัน";
"Cycles" = "รอบ";
"Temperature" = "อุณหภูมิ";
"Power adapter" = "แปลงพลังงาน";
"Power" = "พลังงาน";
"Is charging" = "กำลังชาร์จ";
"Time to discharge" = "เวลาในการชาร์จ";
"Time to charge" = "เวลาในการชาร์จ";
"Calculating" = "การคำนวณ";
"Fully charged" = "เต็มแล้ว";
"Not connected" = "ไม่ได้เชื่อมต่อ";
"Low level notification" = "การแจ้งเตือนระดับต่ำ";
"High level notification" = "การแจ้งเตือนระดับสูง";
"Low battery" = "แบตเตอรี่ต่ำ";
"High battery" = "แบตเตอรี่สูง";
"Battery remaining" = "%0% เหลือ";
"Battery remaining to full charge" = "%0% ในการเต็มแบต";
"Percentage" = "เปอร์เซ็นต์";
"Percentage and time" = "เปอร์เซ็นต์และเวลา";
"Time and percentage" = "เวลาและเปอร์เซ็นต์";
"Time format" = "รูปแบบเวลา";
"Hide additional information when full" = "ซ่อนข้อมูลเพิ่มเติมเมื่อเต็ม";
"Last charge" = "ชาร์จครั้งสุดท้าย";
"Capacity" = "ความจุ";
"current / maximum / designed" = "ปัจจุบัน / สูงสุด / ออกแบบ";
"Low power mode" = "โหมดพลังงานต่ำ";
"Percentage inside the icon" = "เปอร์เซ็นต์ภายในไอคอน";
"Colorize battery" = "ระบุสีแบตเตอรี่"; // translategemma:4b
"Charging current" = "กระแสไฟฟ้าที่ใช้ในการชาร์จ"; // translategemma:4b
"Charging Voltage" = "แรงดันไฟฟ้าในการชาร์จ"; // translategemma:4b
"Charger state inside the battery" = "สถานะของเครื่องชาร์จภายในแบตเตอรี่"; // translategemma:4b

// Bluetooth
"Battery to show" = "แบตเตอรี่ที่แสดง";
"No Bluetooth devices are available" = "ไม่มีอุปกรณ์ Bluetooth ที่ใช้งานได้";

// Clock
"Time zone" = "เขตเวลา"; // translategemma:4b
"Local" = "ในพื้นที่"; // translategemma:4b
"Calendar" = "ปฏิทิน"; // translategemma:4b
"Show week numbers" = "แสดงหมายเลขสัปดาห์"; // translategemma:4b
"Local time" = "เวลาท้องถิ่น"; // translategemma:4b
"Add new clock" = "เพิ่มนาฬิกาใหม่"; // translategemma:4b
"Delete selected clock" = "ลบนาฬิกาที่เลือก"; // translategemma:4b
"Help with datetime format" = "ขอความช่วยเหลือเกี่ยวกับการจัดรูปแบบวันที่และเวลา"; // translategemma:4b

// Colors
"Based on utilization" = "อ้างอิงจากการใช้งาน";
"Based on pressure" = "อ้างอิงจากความดัน";
"Based on cluster" = "อ้างอิงจากกลุ่ม"; // translategemma:4b
"System accent" = "สีโปรแกรมระบบ";
"Monochrome accent" = "สีขาวและดำ";
"Clear" = "ล้าง";
"White" = "ขาว";
"Black" = "ดำ";
"Gray" = "สีเทา";
"Second gray" = "สีเทาอีก";
"Dark gray" = "สีเทาเข้ม";
"Light gray" = "สีเทาอ่อน";
"Red" = "แดง";
"Second red" = "แดงอีก";
"Green" = "เขียว";
"Second green" = "เขียวอีก";
"Blue" = "น้ำเงิน";
"Second blue" = "น้ำเงินอีก";
"Yellow" = "เหลือง";
"Second yellow" = "เหลืองอีก";
"Orange" = "ส้ม";
"Second orange" = "ส้มอีก";
"Purple" = "ม่วง";
"Second purple" = "ม่วงอีก";
"Brown" = "น้ำตาล";
"Second brown" = "น้ำตาลอีก";
"Cyan" = "เขียวฟ้า";
"Magenta" = "มาเกนตา";
"Pink" = "ชมพู";
"Teal" = "น้ำตาลเขียว";
"Indigo" = "น้ำเงินม่วง";
